app/controllers/movies_controller.rb

SELECT * FROM "movies"
---
  def index
    @movies = Movie.all

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
---
  def show
    @movie = Movie.find(params[:id])

SELECT * FROM "movies" WHERE ("movies"."id" = 6)
---
  def edit
    @movie = Movie.find(params[:id])

INSERT INTO "movies" ("rating", "created_at", "title", "overview", "scores", "released_on", "updated_at", "genre") VALUES('R', '2010-10-20 02:36:48', 'Titanic', 'A tragic story about a boat', '5.5', '1987-11-06 00:00:00', '2010-10-20 02:36:48', 'drama')
---
  def createOriginal
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save

INSERT INTO "movies" ("rating", "created_at", "title", "overview", "scores", "released_on", "updated_at", "genre") VALUES('', '2010-10-20 01:29:43', 'Justine', 'In Alexandria, in 1938, Darley, a young British schoolmaster and poet, makes friends through Pursewarden, the British consular officer, with Justine, the beautiful and mysterious wife of a Coptic banker. He observes the affairs of her heart and incidentally discovers that she is involved in a plot against the British, meant to arm the Jewish underground in Palestine. The plot finally fails, Justine is sent to jail and Darley decides to return to England.', '0.0', '1969-01-01 00:00:00', '2010-10-20 01:29:43', 'Crime')
---
  def create
    @name2 = 0
    @id = params[:id]

    attributes = Tmdb.getAttributes(@id)

    @movie = Movie.new(attributes)

    respond_to do |format|
      if @id!='0' and @movie.save

SELECT * FROM "movies" WHERE ("movies"."id" = 6)
UPDATE "movies" SET "updated_at" = '2010-09-16 23:44:34', "rating" = 'R' WHERE "id" = 6
---
  def update
    @movie = Movie.find(params[:id])

    respond_to do |format|
      if @movie.update_attributes(params[:movie])

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
DELETE FROM "movies" WHERE "id" = 1
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy